uploads/customers/123/supportdesk/9901/SOAP Message.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://wservice.rtt.co.za/ws_DEMO/">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:PackStoreExport>
         <ws:packstoreHeader>
            <!--Optional:-->
            <ws:Pack>
               <!--Zero or more repetitions:-->
               <ws:structPackStoreHeaders>
                  <!--Optional:-->
                  <ws:SerialKey></ws:SerialKey>
                  <!--Optional:-->
                  <ws:WhseId></ws:WhseId>
                  <!--Optional:-->
                  <ws:PackKey>0021X144</ws:PackKey>
                  <!--Optional:-->
                  <ws:PackDescr>Canon item 0021x144</ws:PackDescr>
                  <!--Optional:-->
                  <ws:PackUom1>CS</ws:PackUom1>
                  <!--Optional:-->
                  <ws:CaseCnt>24</ws:CaseCnt>
                  <!--Optional:-->
                  <ws:IsWhQty1></ws:IsWhQty1>
                  <!--Optional:-->
                  <ws:ReplenishUom1>N</ws:ReplenishUom1>
                  <!--Optional:-->
                  <ws:ReplenishZone1>CASE</ws:ReplenishZone1>
                  <!--Optional:-->
                  <ws:CartonizeUom1>N</ws:CartonizeUom1>
                  <!--Optional:-->
                  <ws:LengthUom1>0</ws:LengthUom1>
                  <!--Optional:-->
                  <ws:WidthUom1>0</ws:WidthUom1>
                  <!--Optional:-->
                  <ws:HeightUom1>0</ws:HeightUom1>
                  <!--Optional:-->
                  <ws:CubeUom1>0</ws:CubeUom1>
                  <!--Optional:-->
                  <ws:PackUom2>IP</ws:PackUom2>
                  <!--Optional:-->
                  <ws:InnerPack>6</ws:InnerPack>
                  <!--Optional:-->
                  <ws:IsWhQty2></ws:IsWhQty2>
                  <!--Optional:-->
                  <ws:ReplenishUom2>N</ws:ReplenishUom2>
                  <!--Optional:-->
                  <ws:ReplenishZone2>N</ws:ReplenishZone2>
                  <!--Optional:-->
                  <ws:CartonizeUom2>N</ws:CartonizeUom2>
                  <!--Optional:-->
                  <ws:LengthUom2>0</ws:LengthUom2>
                  <!--Optional:-->
                  <ws:WidthUom2>0</ws:WidthUom2>
                  <!--Optional:-->
                  <ws:HeightUom2>0</ws:HeightUom2>
                  <!--Optional:-->
                  <ws:CubeUom2>0</ws:CubeUom2>
                  <!--Optional:-->
                  <ws:PackUom3>EA</ws:PackUom3>
                  <!--Optional:-->
                  <ws:Qty>1</ws:Qty>
                  <!--Optional:-->
                  <ws:IsWhQty3></ws:IsWhQty3>
                  <!--Optional:-->
                  <ws:ReplenishUom3>Y</ws:ReplenishUom3>
                  <!--Optional:-->
                  <ws:ReplenishZone3>N</ws:ReplenishZone3>
                  <!--Optional:-->
                  <ws:CartonizeUom3>Y</ws:CartonizeUom3>
                  <!--Optional:-->
                  <ws:LengthUom3>0</ws:LengthUom3>
                  <!--Optional:-->
                  <ws:WidthUom3>0</ws:WidthUom3>
                  <!--Optional:-->
                  <ws:HeightUom3>0</ws:HeightUom3>
                  <!--Optional:-->
                  <ws:CubeUom3>0</ws:CubeUom3>
                  <!--Optional:-->
                  <ws:PackUom4>PL</ws:PackUom4>
                  <!--Optional:-->
                  <ws:Pallet>720</ws:Pallet>
                  <!--Optional:-->
                  <ws:IsWhQty4></ws:IsWhQty4>
                  <!--Optional:-->
                  <ws:ReplenishUom4>N</ws:ReplenishUom4>
                  <!--Optional:-->
                  <ws:ReplenishZone4>N</ws:ReplenishZone4>
                  <!--Optional:-->
                  <ws:CartonizeUom4>N</ws:CartonizeUom4>
                  <!--Optional:-->
                  <ws:LengthUom4>0</ws:LengthUom4>
                  <!--Optional:-->
                  <ws:WidthUom4>0</ws:WidthUom4>
                  <!--Optional:-->
                  <ws:HeightUom4>0</ws:HeightUom4>
                  <!--Optional:-->
                  <ws:CubeUom4>0</ws:CubeUom4>
                  <!--Optional:-->
                  <ws:PalletWoodLength>1</ws:PalletWoodLength>
                  <!--Optional:-->
                  <ws:PalletWoodWidth>2</ws:PalletWoodWidth>
                  <!--Optional:-->
                  <ws:PalletWoodHeight>3</ws:PalletWoodHeight>
                  <!--Optional:-->
                  <ws:PalletTi>6</ws:PalletTi>
                  <!--Optional:-->
                  <ws:PalletHi>5</ws:PalletHi>
                  </ws:structPackStoreHeaders>ws:structPackStoreHeaders>
            </ws:Pack>
         </ws:packstoreHeader>
      </ws:PackStoreExport>
   </soapenv:Body>
</soapenv:Envelope>